perf/bbox_caso2.yaml
config:
    environments:
      servicio1:
        target: 'http://localhost:9090'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
      servicio2:
        target: 'http://localhost:9091'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn"

    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

    phases:
      - name: Ramp
        duration: 40
        arrivalRate: 1
        rampTo: 30

scenarios:
  - name: Ramp (/)
    flow:
      - get:
          url: '/'