perf/bbox_sincronico-asincronico.yml
config:
  environments:
    servicio1:
      target: 'http://localhost:9090/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-endpoint1"
    servicio2:
      target: 'http://localhost:9091/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-endpoint2"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 100
      arrivalRate: 1
      rampTo: 20

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'